system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       latestTime;

startTime       0; 

stopAt          endTime;

endTime         100;
deltaT          0.0001; 

writeControl    adjustableRunTime;

writeInterval   0.02; 

purgeWrite      0; 

writeFormat     binary; 

writePrecision  12;

writeCompression uncompressed; 

timeFormat      general;

timePrecision   12;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.8; 
maxAlphaCo      0.5; 

maxDeltaT       1;

functions
{
 #includeFunc flowRatePatch(name=aval_bas)
 #includeFunc flowRatePatch(name=amont_bas)

   
   /*probeY2p5 
   {
     type probes
     functionObjectLibs ("libsampling.dylib");
     fields
      (
        p_rgh
      );

     probeLocations
      (
       (1.0 2.5 0.0)
       (2.0 2.5 0.0)
       (3.0 2.5 0.0)
       (4.0 2.5 0.0)
       (4.75 2.5 0.0)
       (5.25 2.5 1.0)
       (6.0 2.5 0.0)
       (7.0 2.5 0.0)
       (8.0 2.5 0.0)
       (9.0 2.5 0.0)
     );
     }*/
     
}


// ************************************************************************* //
