system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear 1;            
    limitedGrad      cellLimited Gauss linear 1; 
}

divSchemes
{
  div(rhoPhi,U)  Gauss linearUpwind grad(U); //upwind; //limitedLinearV 1;
  div(phi,alpha) Gauss vanLeer;              //upwind; //vanLeer;
  div(phirb,alpha) Gauss interfaceCompression;
  div(phi,k)       Gauss upwind;
  div(phi,epsilon) Gauss upwind;
  div((muEff*dev(T(grad(U))))) Gauss linear;
  div((nuEff*dev2(T(grad(U))))) Gauss linear;
  div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p_rgh;
    pcorr;
    alpha.water;
}


// ************************************************************************* //
